Чистая/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Чистая/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент) 
	
	ТекущиеДанныеТаблицы = Элементы.Цены.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	
	
	ПриИзмененииНоменклатуры(ТекущиеДанныеТаблицы);
	
КонецПроцедуры
	

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, ЭтотОбъект.Объект.Дата);
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Параметр = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",Параметр, Элементы.Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", ВыбранноеЗначение);
	НайденныеСтроки = Объект.Цены.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Сообщить(СтрШаблон("%1 уже есть в списке.", ВыбранноеЗначение));
		Возврат
	Иначе
		
		
		СтрокаТаблицы = Объект.Цены.Добавить();
		СтрокаТаблицы.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(СтрокаТаблицы);
	КонецЕсли;

	
КонецПроцедуры
